#微信回复的统一模版
XmlForm = """
<xml>
<ToUserName><![CDATA[{0}]]></ToUserName>
<FromUserName><![CDATA[{1}]]></FromUserName>
<CreateTime>{2}</CreateTime>
<MsgType><![CDATA[text]]></MsgType>
<Content><![CDATA[{3}]]></Content>
</xml>
"""

#目录页的内容
catalogue =\
'''若回复：
"0"-索引页(本页)
"1"-综合耐久示例
"2"-综合耐久空表
"3"-高强耐久示例
"4"-高强耐久空表
"5"-注意事项 '''
template1 = \
'''综合耐久示例为:
0.识别码:1234
1.试验项目:A12
2.试验车辆:PV136
3.驾驶员:张三
4.上班时间:7:40
5.下班时间:15:00
6.开始里程:1530
7.结束里程:1620
8.主循环:3
9.A循环:2
10.B循环:0
11.C循环:1
12.高环里程:200
13.连接里程:38
14.能耗:36'''
template2 = \
'''0.识别码:
1.试验项目:
2.试验车辆:
3.驾驶员:
4.上班时间:
5.下班时间:
6.开始里程:
7.结束里程:
8.主循环:
9.A循环:
10.B循环:
11.C循环:
12.高环里程:
13.连接里程:
14.能耗:'''
template3 = \
'''高强耐久示例为:
0.识别码:1234
1.试验项目:A12
2.试验车辆:PV136
3.驾驶员:张三
4.上班时间:7:40
5.下班时间:15:00
6.开始里程:1530
7.结束里程:1620
8.连接里程:38
9.能耗:36'''
template4 = \
'''0.识别码:
1.试验项目:
2.试验车辆:
3.驾驶员:
4.上班时间:
5.下班时间:
6.开始里程:
7.结束里程:
8.连接里程:
9.能耗:'''
template5 = \
'''注意事项:
1.日报请于下班后及时填写，隔日会出现日期不正确；
2.上下班时间请用24小时制；
3.时间请用英文:连接；
4.能耗油车填写加油量，电车填写耗电量；
5.务必按规定填写，否则无法提交成功。'''
template6 = \
'''
回复"目录"或"0"获取索引。
'''
passwd = '4321'
template = [template1,template2,template3,template4,template5,template6]